InformationRegisters/ДатыКомплекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДатыКомплекта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>БезГабаритногоЧертежа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БезЗамера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГантКонструктораНачалоПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГантКонструктораНачалоРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГантКонструктораОкончаниеПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГантКонструктораОкончаниеРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГОСТ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейПКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейРКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейТЗ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КатегорияКонструктора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Код_в_PDM</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерДоработка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерИзменение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерКорректировка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерРКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремени_ПКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремени_РКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремени_ТЗ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РКД_отдельно_от_композиции</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СогласованДизайнером</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокМонтажа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокПроектирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокПроизводства</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКомплекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыКомплектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоДоработка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоРекламация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДатыКомплектаМонтаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДатыКомплектаМонтаж</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КрайМонтажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоМонтажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремениМонтажа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоСотрудниковМонтаж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДатыКомплектаПроизводство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДатыКомплектаПроизводство</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НачалоПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайСтолярка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайМалярка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайПодрядчик</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоСтолярка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоМалярка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоПодрядчик</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремениПроизводства</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/омДиаграммаГанта/Ext/Module.bsl
&НаСервере
Функция  ПолучитьИнтервалДиаграммы(Проект, тзДатыОкончания) Экспорт

	стИнтервал = Новый Структура("ДатаНачала,ДатаОкончания",Дата(1,1,1), Дата(1,1,1));
	
	тзОкончанияСделка = Новый ТаблицаЗначений;
	тзОкончанияСделка.Колонки.Добавить("Проект", Новый ОписаниеТипов("СправочникСсылка.Проекты"));
	тзОкончанияСделка.Колонки.Добавить("ОкончаниеСЗапасом", Новый ОписаниеТипов("Дата"));
	тзОкончанияСделка.Индексы.Добавить("Проект");
	
	Для каждого х Из тзДатыОкончания Цикл
		
		НайденаяСтрока = тзОкончанияСделка.Найти(х.Проект,"Проект");
		Если НайденаяСтрока = Неопределено Тогда
			ЗаполнитьЗначенияСвойств(тзОкончанияСделка.Добавить() ,х);	
		Иначе	
		   	Если НайденаяСтрока.ОкончаниеСЗапасом < х.ОкончаниеМонтаж Тогда
				НайденаяСтрока.ОкончаниеСЗапасом = х.ОкончаниеМонтаж;
			КонецЕсли;
			
		   	Если НайденаяСтрока.ОкончаниеСЗапасом < х.ОкончаниеСЗапасом Тогда
				НайденаяСтрока.ОкончаниеСЗапасом = х.ОкончаниеСЗапасом;
			КонецЕсли;
		КонецЕсли;
	
	КонецЦикла;

	Если ЗначениеЗаполнено(Проект) Тогда
		Если ТипЗнч(Проект) = Тип("СправочникСсылка.Проекты") Тогда
		
			Возврат ПолучитьИнтервалДиаграммыОднаСделка(Проект,стИнтервал, тзОкончанияСделка);	
		
		Иначе
		
			Возврат ПолучитьИнтервалДиаграммыМассивСделок(Проект, тзОкончанияСделка);	
		
		КонецЕсли;
	
	Иначе
	
		Возврат Новый ТаблицаЗначений;	
	
	КонецЕсли;
КонецФункции //  ПолучитьИнтервалДиаграммы(Сделка)

&НаСервере
Функция ПолучитьИнтервалДиаграммыМассивСделок(мСделок, тзДатыОкончания)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДатыКомплекта.Проект КАК Проект,
	|	ЕСТЬNULL(МАКСИМУМ(ДатыКомплекта.КрайПКД), ДАТАВРЕМЯ(1, 1, 1)) КАК Дата
	|ИЗ
	|	РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
	|ГДЕ
	|	ДатыКомплекта.Проект В(&мСделок)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДатыКомплекта.Проект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДатыКомплекта.Проект КАК Проект,
	|	ЕСТЬNULL(МИНИМУМ(ДатыКомплекта.НачалоПКД), ДАТАВРЕМЯ(1, 1, 1)) КАК Дата
	|ИЗ
	|	РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
	|ГДЕ
	|	ДатыКомплекта.Проект В(&мСделок)
	|	И ДатыКомплекта.НачалоПКД > ДАТАВРЕМЯ(1, 1, 1)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДатыКомплекта.Проект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДатыКомплекта.Проект КАК Проект,
	|	ЕСТЬNULL(МАКСИМУМ(ДатыКомплекта.КрайРКД), ДАТАВРЕМЯ(1, 1, 1)) КАК Дата
	|ИЗ
	|	РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
	|ГДЕ
	|	ДатыКомплекта.Проект В(&мСделок)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДатыКомплекта.Проект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДатыКомплекта.Проект КАК Проект,
	|	ЕСТЬNULL(МИНИМУМ(ДатыКомплекта.НачалоРКД), ДАТАВРЕМЯ(1, 1, 1)) КАК Дата
	|ИЗ
	|	РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
	|ГДЕ
	|	ДатыКомплекта.Проект В(&мСделок)
	|	И ДатыКомплекта.НачалоРКД > ДАТАВРЕМЯ(1, 1, 1)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДатыКомплекта.Проект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДатыКомплекта.Проект КАК Проект,
	|	ЕСТЬNULL(МАКСИМУМ(ДатыКомплекта.КрайТЗ), ДАТАВРЕМЯ(1, 1, 1)) КАК Дата
	|ИЗ
	|	РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
	|ГДЕ
	|	ДатыКомплекта.Проект В(&мСделок)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДатыКомплекта.Проект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДатыКомплекта.Проект КАК Проект,
	|	ЕСТЬNULL(МИНИМУМ(ДатыКомплекта.НачалоТЗ), ДАТАВРЕМЯ(1, 1, 1)) КАК Дата
	|ИЗ
	|	РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
	|ГДЕ
	|	ДатыКомплекта.Проект В(&мСделок)
	|	И ДатыКомплекта.НачалоТЗ > ДАТАВРЕМЯ(1, 1, 1)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДатыКомплекта.Проект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДатыКомплектаМонтаж.Проект КАК Проект,
	|	ЕСТЬNULL(МАКСИМУМ(ДатыКомплектаМонтаж.КрайМонтажа), ДАТАВРЕМЯ(1, 1, 1)) КАК Дата
	|ИЗ
	|	РегистрСведений.ДатыКомплектаМонтаж КАК ДатыКомплектаМонтаж
	|ГДЕ
	|	ДатыКомплектаМонтаж.Проект В(&мСделок)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДатыКомплектаМонтаж.Проект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДатыКомплектаМонтаж.Проект КАК Проект,
	|	ЕСТЬNULL(МИНИМУМ(ДатыКомплектаМонтаж.НачалоМонтажа), ДАТАВРЕМЯ(1, 1, 1)) КАК Дата
	|ИЗ
	|	РегистрСведений.ДатыКомплектаМонтаж КАК ДатыКомплектаМонтаж
	|ГДЕ
	|	ДатыКомплектаМонтаж.Проект В(&мСделок)
	|	И ДатыКомплектаМонтаж.НачалоМонтажа > ДАТАВРЕМЯ(1, 1, 1)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДатыКомплектаМонтаж.Проект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДатыКомплектаПроизводство.Проект КАК Проект,
	|	ЕСТЬNULL(МАКСИМУМ(ДатыКомплектаПроизводство.КрайПроизводства), ДАТАВРЕМЯ(1, 1, 1)) КАК Дата
	|ИЗ
	|	РегистрСведений.ДатыКомплектаПроизводство КАК ДатыКомплектаПроизводство
	|ГДЕ
	|	ДатыКомплектаПроизводство.Проект В(&мСделок)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДатыКомплектаПроизводство.Проект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДатыКомплектаПроизводство.Проект КАК Проект,
	|	ЕСТЬNULL(МИНИМУМ(ДатыКомплектаПроизводство.НачалоПроизводства), ДАТАВРЕМЯ(1, 1, 1)) КАК Дата
	|ИЗ
	|	РегистрСведений.ДатыКомплектаПроизводство КАК ДатыКомплектаПроизводство
	|ГДЕ
	|	ДатыКомплектаПроизводство.Проект В(&мСделок)
	|	И ДатыКомплектаПроизводство.НачалоПроизводства > ДАТАВРЕМЯ(1, 1, 1)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДатыКомплектаПроизводство.Проект";
	
	Запрос.УстановитьПараметр("мСделок", мСделок);
	ВыборкаПакет = Запрос.ВыполнитьПакет(); 
	
	ТипДата = Новый ОписаниеТипов("Дата");
	тзИнтервалыСделок = Новый ТаблицаЗначений;
	тзИнтервалыСделок.Колонки.Добавить("Проект", 		Новый ОписаниеТипов("СправочникСсылка.Проекты"));
	тзИнтервалыСделок.Колонки.Добавить("ДатаНачала", 	ТипДата);
	тзИнтервалыСделок.Колонки.Добавить("ДатаОкончания", ТипДата);
	тзИнтервалыСделок.Индексы.Добавить("Проект");
	
	Выборка = ВыборкаПакет[0].Выбрать();
	ЗаполнитьСтрокуИнтервалСделки(тзИнтервалыСделок, Ложь, Выборка);
	
	Выборка = ВыборкаПакет[2].Выбрать();
	ЗаполнитьСтрокуИнтервалСделки(тзИнтервалыСделок, Ложь, Выборка);
	
	Выборка = ВыборкаПакет[4].Выбрать();
	ЗаполнитьСтрокуИнтервалСделки(тзИнтервалыСделок, Ложь, Выборка);
	
	Выборка = ВыборкаПакет[6].Выбрать();
	ЗаполнитьСтрокуИнтервалСделки(тзИнтервалыСделок, Ложь, Выборка);
	
	Выборка = ВыборкаПакет[8].Выбрать();
	ЗаполнитьСтрокуИнтервалСделки(тзИнтервалыСделок, Ложь, Выборка);
	
	Выборка = ВыборкаПакет[1].Выбрать();
	ЗаполнитьСтрокуИнтервалСделки(тзИнтервалыСделок, Истина, Выборка);
	
	Выборка = ВыборкаПакет[3].Выбрать();
	ЗаполнитьСтрокуИнтервалСделки(тзИнтервалыСделок, Истина, Выборка);
	
	Выборка = ВыборкаПакет[5].Выбрать();
	ЗаполнитьСтрокуИнтервалСделки(тзИнтервалыСделок, Истина, Выборка);
	
	Выборка = ВыборкаПакет[7].Выбрать();
	ЗаполнитьСтрокуИнтервалСделки(тзИнтервалыСделок, Истина, Выборка);
	
	Выборка = ВыборкаПакет[9].Выбрать();
	ЗаполнитьСтрокуИнтервалСделки(тзИнтервалыСделок, Истина, Выборка);
	
	Для каждого х Из тзИнтервалыСделок Цикл
		НайденаяСтрока = тзДатыОкончания.Найти(х.Проект,"Проект");
		Если НЕ НайденаяСтрока = Неопределено Тогда
		   	Если НайденаяСтрока.ОкончаниеСЗапасом > х.ДатаОкончания Тогда
				х.ДатаОкончания = НайденаяСтрока.ОкончаниеСЗапасом;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат тзИнтервалыСделок;
КонецФункции // ПолучитьИнтервалДиаграммыМассивСделок()

&НаСервере
Процедура ЗаполнитьСтрокуИнтервалСделки(тзИнтервалыСделок, Минимум, Выборка)

	
	Пока Выборка.Следующий() Цикл
		
		Проект 	= Выборка.Проект;
		текДата =  Выборка.Дата;
		
		НайденаяСтрока = тзИнтервалыСделок.Найти(Проект, "Проект");
		Если НайденаяСтрока = Неопределено Тогда
			НайденаяСтрока = тзИнтервалыСделок.Добавить();
			НайденаяСтрока.Проект = Проект;
		КонецЕсли;
		
		Если Минимум Тогда
			
			Если ЗначениеЗаполнено(НайденаяСтрока.ДатаНачала) Тогда
				НайденаяСтрока.ДатаНачала = ?(текДата > НайденаяСтрока.ДатаНачала, НайденаяСтрока.ДатаНачала, текДата);	
			Иначе
				НайденаяСтрока.ДатаНачала = текДата;	
			КонецЕсли;	
			
		Иначе
			НайденаяСтрока.ДатаОкончания = ?(текДата < НайденаяСтрока.ДатаОкончания, НайденаяСтрока.ДатаОкончания, текДата);	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьСтрокуИнтервалСделки()


&НаСервере
Функция ПолучитьИнтервалДиаграммыОднаСделка(Проект,стИнтервал, тзДатыОкончания)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(ЕСТЬNULL(ДатыКомплекта.КрайПКД, ДАТАВРЕМЯ(1, 1, 1))) КАК КрайПКД,
		|	МАКСИМУМ(ЕСТЬNULL(ДатыКомплекта.КрайРКД, ДАТАВРЕМЯ(1, 1, 1))) КАК КрайРКД,
		|	МИНИМУМ(ЕСТЬNULL(ДатыКомплекта.КрайТЗ, ДАТАВРЕМЯ(1, 1, 1))) КАК КрайТЗ,
		|	МАКСИМУМ(ЕСТЬNULL(ДатыКомплекта.КрайМонтажа, ДАТАВРЕМЯ(1, 1, 1))) КАК КрайМонтажа,
		|	МАКСИМУМ(ЕСТЬNULL(ДатыКомплекта.КрайПроизводства, ДАТАВРЕМЯ(1, 1, 1))) КАК КрайПроизводства,
		|	ДатыКомплекта.НормаВремени_ПКД КАК НормаВремени_ПКД,
		|	ДатыКомплекта.НормаВремени_РКД КАК НормаВремени_РКД,
		|	ДатыКомплекта.НормаВремени_ТЗ КАК НормаВремени_ТЗ,
		|	ДатыКомплекта.НормаВремени_Монтажа КАК НормаВремени_Монтажа,
		|	ДатыКомплекта.НормаВремени_Производство КАК НормаВремени_Производство
		|ИЗ
		|	РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
		|ГДЕ
		|	ДатыКомплекта.Проект = &Проект
		|
		|СГРУППИРОВАТЬ ПО
		|	ДатыКомплекта.НормаВремени_ПКД,
		|	ДатыКомплекта.НормаВремени_РКД,
		|	ДатыКомплекта.НормаВремени_ТЗ,
		|	ДатыКомплекта.НормаВремени_Монтажа,
		|	ДатыКомплекта.НормаВремени_Производство";
	
	Запрос.УстановитьПараметр("Проект",Проект);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл

		стИнтервал.ДатаОкончания = ?(стИнтервал.ДатаОкончания < Выборка.КрайПКД, 			Выборка.КрайПКД, 			стИнтервал.ДатаОкончания);
		стИнтервал.ДатаОкончания = ?(стИнтервал.ДатаОкончания < Выборка.КрайРКД, 			Выборка.КрайРКД, 			стИнтервал.ДатаОкончания);
		стИнтервал.ДатаОкончания = ?(стИнтервал.ДатаОкончания < Выборка.КрайТЗ, 			Выборка.КрайТЗ, 			стИнтервал.ДатаОкончания);
		стИнтервал.ДатаОкончания = ?(стИнтервал.ДатаОкончания < Выборка.КрайМонтажа, 		Выборка.КрайМонтажа, 		стИнтервал.ДатаОкончания);
		стИнтервал.ДатаОкончания = ?(стИнтервал.ДатаОкончания < Выборка.КрайПроизводства, 	Выборка.КрайПроизводства, 	стИнтервал.ДатаОкончания);
		
		стИнтервал.ДатаНачала = РасчитатьДатаНачала(стИнтервал.ДатаНачала,Выборка.КрайПКД,			Выборка.НормаВремени_ПКД);
		стИнтервал.ДатаНачала = РасчитатьДатаНачала(стИнтервал.ДатаНачала,Выборка.КрайРКД,			Выборка.НормаВремени_РКД);
		стИнтервал.ДатаНачала = РасчитатьДатаНачала(стИнтервал.ДатаНачала,Выборка.КрайТЗ,			Выборка.НормаВремени_ТЗ);
		стИнтервал.ДатаНачала = РасчитатьДатаНачала(стИнтервал.ДатаНачала,Выборка.КрайМонтажа,		Выборка.НормаВремени_Монтажа);
		стИнтервал.ДатаНачала = РасчитатьДатаНачала(стИнтервал.ДатаНачала,Выборка.КрайПроизводства,	Выборка.НормаВремени_Производство);
		
	КонецЦикла;
	
	НайденаяСтрока = тзДатыОкончания.Найти(Проект,"Проект");
	Если НЕ НайденаяСтрока = Неопределено Тогда
		Если НайденаяСтрока.ОкончаниеСЗапасом > стИнтервал.ДатаОкончания Тогда
			стИнтервал.ДатаОкончания = НайденаяСтрока.ОкончаниеСЗапасом;
		КонецЕсли;
	КонецЕсли;
	
	Возврат стИнтервал;
КонецФункции // ПолучитьИнтервалДиаграммыМассивСделок()

&НаСервере
Функция РасчитатьДатаНачала(ДатаНачала, Край, Норма)
	Если Край = Дата(1,1,1) Тогда
		Возврат ДатаНачала; 
	КонецЕсли;
	
	Если ДатаНачала = Дата(1,1,1) Тогда
		Возврат Край; 
	КонецЕсли;
	
	ВремяДата = Край - 24 *3600 * Норма;
	Если ВремяДата > ДатаНачала Тогда
		Возврат ДатаНачала;
	КонецЕсли;
	Возврат ВремяДата;
КонецФункции // РасчитатьДатаНачала(ДатаНачала, Край, Норма)

&НаСервере
Функция ПолучитьЦвет(НаименованиеЭтапа, тзЦвета, ЭтоГруппа = Ложь, СократитьНаименование = Ложь) Экспорт
	
	Если тзЦвета = Неопределено Тогда
	
		тзЦвета = ПолучитьТаблицуЦветов();	
	
	КонецЕсли;
	
	стОтбор = Новый Структура("НаименованиеЭтапа, ЭтоГруппа", НаименованиеЭтапа, ЭтоГруппа);
	
	НайденыеСтроки = тзЦвета.НайтиСтроки(стОтбор);
	
	Если НайденыеСтроки.Количество() = 0 Тогда
		Возврат WebЦвета.ЗамшаСветлый;
	КонецЕсли;

	СократитьНаименование = НайденыеСтроки[0].СократитьНаименование;
	
	Возврат НайденыеСтроки[0].Цвет;
КонецФункции // ПолучитьЦвет()

&НаСервере                      
Функция ПолучитьТаблицуЦветов() Экспорт

	тзЦвета = Новый ТаблицаЗначений;
	тзЦвета.Колонки.Добавить("НаименованиеЭтапа", 		Новый ОписаниеТипов("Строка"));
	тзЦвета.Колонки.Добавить("ЭтоГруппа", 				Новый ОписаниеТипов("Булево"));
	тзЦвета.Колонки.Добавить("СократитьНаименование", 	Новый ОписаниеТипов("Булево"));
	тзЦвета.Колонки.Добавить("Цвет");
	
	НС = тзЦвета.Добавить();
	НС.НаименованиеЭтапа 		= "ТЗ";	
	НС.Цвет 					= WebЦвета.Бирюзовый;	
	НС.СократитьНаименование	= Истина;	

	НС = тзЦвета.Добавить();
	НС.НаименованиеЭтапа 		= "ПКД";	
	НС.Цвет 					= WebЦвета.СероСиний;	
	НС.СократитьНаименование	= Истина;	

	НС = тзЦвета.Добавить();
	НС.НаименованиеЭтапа 		= "РКД";	
	НС.Цвет 					= WebЦвета.СинийСоСтальнымОттенком;	
	НС.СократитьНаименование	= Истина;	

	НС = тзЦвета.Добавить();
	НС.НаименованиеЭтапа 		= "Производство";	
	НС.Цвет 					= WebЦвета.Фиолетовый;	
	НС.СократитьНаименование	= Истина;	

	НС = тзЦвета.Добавить();
	НС.НаименованиеЭтапа 		= "Монтаж";	
	НС.Цвет 					= WebЦвета.ЦветМорскойВолныНейтральный;	
	НС.СократитьНаименование	= Истина;	

	НС = тзЦвета.Добавить();
	НС.НаименованиеЭтапа 		= "Монтаж";	
	НС.ЭтоГруппа				= Истина;	
	НС.Цвет 					= WebЦвета.Зеленый;	
	НС.СократитьНаименование	= Истина;	

	НС = тзЦвета.Добавить();
	НС.НаименованиеЭтапа 		= "Проект";	
	НС.Цвет 					= WebЦвета.Бежевый;	
	НС.СократитьНаименование	= Ложь;	

	НС = тзЦвета.Добавить();
	НС.НаименованиеЭтапа 		= "КрайняяДата";	
	НС.Цвет 					= WebЦвета.Красный;	
	НС.СократитьНаименование	= Истина;	

	НС = тзЦвета.Добавить();
	НС.НаименованиеЭтапа 		= "Столярка";	
	НС.Цвет 					= WebЦвета.НейтральноПурпурный;	
	НС.СократитьНаименование	= Истина;	

	НС = тзЦвета.Добавить();
	НС.НаименованиеЭтапа 		= "Малярка";	
	НС.Цвет 					= WebЦвета.НейтральноПурпурный;	
	НС.СократитьНаименование	= Истина;	

	НС = тзЦвета.Добавить();
	НС.НаименованиеЭтапа 		= "Подрядчик";	
	НС.Цвет 					= WebЦвета.СветлоНебесноГолубой;	
	НС.СократитьНаименование	= Истина;	

	НС = тзЦвета.Добавить();
	НС.НаименованиеЭтапа 		= "Исполнитель";	
	НС.Цвет 					= WebЦвета.НейтральноЗеленый;	
	НС.СократитьНаименование	= Истина;	

	НС = тзЦвета.Добавить();
	НС.НаименованиеЭтапа 		= "Пересечение";	
	НС.Цвет 					= WebЦвета.ЗеленоватоЖелтый;	
	НС.СократитьНаименование	= Истина;	

	НС = тзЦвета.Добавить();
	НС.НаименованиеЭтапа 		= "Композиция";	
	НС.Цвет 					= WebЦвета.ЗеленыйЛес;	
	НС.СократитьНаименование	= Истина;	

	НС = тзЦвета.Добавить();
	НС.НаименованиеЭтапа 		= "КомпозицияЭлемент";	
	НС.Цвет 					= WebЦвета.СветлоЗеленый;	
	НС.СократитьНаименование	= Истина;	

	НС = тзЦвета.Добавить();
	НС.НаименованиеЭтапа 		= "Конструирование";	
	НС.Цвет 					= WebЦвета.ТемноОранжевый;	
	НС.СократитьНаименование	= Истина;	

	НС = тзЦвета.Добавить();
	НС.НаименованиеЭтапа 		= "Конструирование";	
	НС.ЭтоГруппа				= Истина;	
	НС.Цвет 					= WebЦвета.РыжеватоКоричневый;	
	НС.СократитьНаименование	= Истина;	

	НС = тзЦвета.Добавить();
	НС.НаименованиеЭтапа 		= "Согласования";	
	НС.ЭтоГруппа				= Ложь;	
	НС.Цвет 					= WebЦвета.Серый;	
	НС.СократитьНаименование	= Ложь;	

	НС = тзЦвета.Добавить();
	НС.НаименованиеЭтапа 		= "Согласования";	
	НС.ЭтоГруппа				= Истина;	
	НС.Цвет 					= WebЦвета.Серый;	
	НС.СократитьНаименование	= Ложь;	

	НС = тзЦвета.Добавить();
	НС.НаименованиеЭтапа 		= "Помещение";	
	НС.ЭтоГруппа				= Ложь;	
	НС.Цвет 					= WebЦвета.БледноЗолотистый;	
	НС.СократитьНаименование	= Истина;	

	НС = тзЦвета.Добавить();
	НС.НаименованиеЭтапа 		= "ПланКонструирование";	
	НС.ЭтоГруппа				= Ложь;	
	НС.Цвет 					= WebЦвета.Васильковый;	
	НС.СократитьНаименование	= Истина;	

	НС = тзЦвета.Добавить();
	НС.НаименованиеЭтапа 		= "Пауза";	
	НС.ЭтоГруппа				= Ложь;	
	НС.Цвет 					= WebЦвета.СветлоКоралловый;	
	НС.СократитьНаименование	= Истина;	

    Возврат тзЦвета;

КонецФункции // ПолучитьТаблицуЦветов()
